Revit 2027 API
ExportLayerTableIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual KeyValuePair<ExportLayerKey, ExportLayerInfo> Current { get; }
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportLayerKey, ExportLayerInfo)
	Get
public:
virtual property KeyValuePair<ExportLayerKey^, ExportLayerInfo^> Current {
	KeyValuePair<ExportLayerKey^, ExportLayerInfo^> get ();
}
abstract Current : KeyValuePair<ExportLayerKey, ExportLayerInfo> with get
override Current : KeyValuePair<ExportLayerKey, ExportLayerInfo> with get
Property Value
KeyValuePair<ExportLayerKey, ExportLayerInfo>
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
ExportLayerTableIterator Class
Autodesk.Revit.DB Namespace